print('*' * 12, 'Печать таблицы', '*' * 12)

'''
Требуется вывести таблицу в Терминал.
'''
from prettytable import PrettyTable

'''
Обратите внимание, что ошибки TypeError не происходит из-за смены 
мест слагаемых. Потому что в обоих случаях мы имеем дело с 
экземплярами класса BankAccount, а в нем имеется реализация 
метода __add__. Меняется только значения, которые поступают в self и other.
'''
th = ['Метод сравнения', 'Противоположный метод сравнения']
td = [
    '__eq__(self, other)',
    '__ne__(self, other)',
    '__lt__(self, other)',
    '__gt__(self, other)',
    '__le__(self, other)',
    '__ge__(self, other)',
]

columns = len(th)  # Подсчитаем кол-во столбцов на будущее.

table = PrettyTable(th)  # Определяем таблицу.

# Cкопируем список td, на случай если он будет использоваться в коде дальше.
td_data = td[:]
# Входим в цикл который заполняет нашу таблицу.
# Цикл будет выполняться до тех пор, пока у нас не кончатся данные
# для заполнения строк таблицы (список td_data).
while td_data:
    # Используя срез добавляем первые два элемента в строку.
    # (columns = 2).
    table.add_row(td_data[:columns])
    # Используя срез переопределяем td_data так, чтобы он
    # больше не содержал первых 2 элементов.
    td_data = td_data[columns:]

print(table)  # Печатаем таблицу
