print('*' * 25)

'''
ДЕЛЕНИЕ С ОКРУГЛЕНИЕМ ВНИЗ

В Python при делении целых чисел используется округление вниз 
(или «в сторону меньшего»). Это значит, что если результат деления 
получается отрицательным и нецелым, мы округляем его в меньшую сторону.

Вычисляем -8 / 5:

        −8/5 = −1.6

Округляем вниз до целого числа: Чтобы получить целую часть, мы 
округляем -1.6 вниз, то есть берём меньшее целое число — это будет -2.

Если бы мы округляли вверх, то результат был бы -1, но Python использует 
округление вниз.

Записываем деление с остатком: Теперь мы знаем, что:

        −8 = (−2) × 5 + 2

то есть остаток равен 2.

Проверка:
Целая часть -8 // 5 равна -2 (округлили вниз).
Остаток -8 % 5 равен 2.

Резюме:
В Python для отрицательных чисел целая часть деления всегда округляется вниз.
'''

'''
ОБЪЯСНЕНИЕ:

Допустим, у нас есть список:

lst = [1, 2, 3, 4, 5, 6]
shift = 2

Задача — сдвиг этого списка на 2 позиции вправо.

1. lst[-shift:] — это срез с конца списка
lst[-shift:] — это срез списка, начиная с элемента, который находится 
на позиции -shift с конца списка, и до конца списка.

В нашем случае shift = 2, то есть -shift = -2.
Это значит, что мы начинаем срез с предпоследнего элемента и идем до конца.
Для списка [1, 2, 3, 4, 5, 6]:

lst[-2:] даст нам последние два элемента: [5, 6].

2. lst[:-shift] — это срез, который берёт все элементы до -shift
lst[:-shift] — это срез списка, начиная с первого элемента и заканчивая 
элементом на позиции -shift.

В нашем случае shift = 2, то есть -shift = -2.
Это значит, что мы берем все элементы до второго с конца (то есть, не включая элементы [5, 6]).
Для списка [1, 2, 3, 4, 5, 6]:

lst[:-2] даст нам первые четыре элемента: [1, 2, 3, 4].

3. Соединение двух частей
Теперь, что происходит дальше:

Мы берём последние shift элементов, т.е. [5, 6], и ставим их в начало.
После этого добавляем к ним оставшиеся элементы, которые шли до сдвига, т.е. [1, 2, 3, 4].
И в итоге мы получаем новый список:

[5, 6, 1, 2, 3, 4]

Для сдвига влево
Если shift отрицательное, например, shift = -2, то срезы будут работать 
немного по-другому, но принцип остается тем же. Мы инвертируем порядок 
элементов для циклического сдвига.

Подытожим:

return lst[-shift:] + lst[:-shift]
lst[-shift:] — это последние shift элементов из списка.
lst[:-shift] — это все элементы списка, кроме последних shift элементов.

Мы соединяем эти две части, чтобы выполнить циклический сдвиг.
Надеюсь, теперь стало немного яснее! Если что-то еще не понятно, 
не стесняйся задавать вопросы!
'''

def rotate(lst: list[int | float], shift=1) -> list[int | float]:
    """Функция выполняет циклический сдвиг списка на shift позиций вправо(shift>0) или влево(shift<0)"""
    # Определим длину списка
    n = len(lst)
    # Если список пуст или сдвиг равен 0, возвращаем список без изменений
    if n == 0 or shift == 0:
        return lst
    # Приведем shift в диапазон от -n до n, чтобы избежать лишних полных циклов
    shift %= n
    # Сдвиг влево эквивалентен сдвигу вправо на (n - shift) позиций
    return lst[-shift:] + lst[:-shift]

# Проверка работы функции
print(rotate.__doc__)
print(rotate.__annotations__)
print(rotate([1, 2, 3, 4, 5, 6], 2))  # Должно вывести: [5, 6, 1, 2, 3, 4]
